In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName('Missing Values').getOrCreate()

In [3]:
df_pyspark = spark.read.option('header','True').csv('test.csv',inferSchema=True)

In [4]:
df_pyspark.show()

+---------+---------+----------+-----+
|     Name|   Salary|Experience|  Age|
+---------+---------+----------+-----+
|     kunj|    54154|        45|  454|
|     emma|    53454|       546| null|
|    raman|    44546|       465|   45|
|    madhu|     null|       546| 4556|
|   sanjay|546545646|      null| 5456|
|akarshika|    54645|        54|54785|
|     null|     null|      null|45654|
+---------+---------+----------+-----+

In [5]:
df_pyspark.na.drop().show() #drop where the nan value exxists

+---------+------+----------+-----+
|     Name|Salary|Experience|  Age|
+---------+------+----------+-----+
|     kunj| 54154|        45|  454|
|    raman| 44546|       465|   45|
|akarshika| 54645|        54|54785|
+---------+------+----------+-----+

In [6]:
##any = how
df_pyspark.na.drop(how='all').show() # means if all the values are null in a row than drop

+---------+---------+----------+-----+
|     Name|   Salary|Experience|  Age|
+---------+---------+----------+-----+
|     kunj|    54154|        45|  454|
|     emma|    53454|       546| null|
|    raman|    44546|       465|   45|
|    madhu|     null|       546| 4556|
|   sanjay|546545646|      null| 5456|
|akarshika|    54645|        54|54785|
|     null|     null|      null|45654|
+---------+---------+----------+-----+

In [7]:
df_pyspark.na.drop(how='any').show() # if any value is null in a row than drop

+---------+------+----------+-----+
|     Name|Salary|Experience|  Age|
+---------+------+----------+-----+
|     kunj| 54154|        45|  454|
|    raman| 44546|       465|   45|
|akarshika| 54645|        54|54785|
+---------+------+----------+-----+

In [8]:
df_pyspark.na.drop(how='any',thresh=2).show() # if atleast 2 nan values than drop

+---------+---------+----------+-----+
|     Name|   Salary|Experience|  Age|
+---------+---------+----------+-----+
|     kunj|    54154|        45|  454|
|     emma|    53454|       546| null|
|    raman|    44546|       465|   45|
|    madhu|     null|       546| 4556|
|   sanjay|546545646|      null| 5456|
|akarshika|    54645|        54|54785|
+---------+---------+----------+-----+

In [9]:
df_pyspark.na.drop(subset=['Age']).show()

+---------+---------+----------+-----+
|     Name|   Salary|Experience|  Age|
+---------+---------+----------+-----+
|     kunj|    54154|        45|  454|
|    raman|    44546|       465|   45|
|    madhu|     null|       546| 4556|
|   sanjay|546545646|      null| 5456|
|akarshika|    54645|        54|54785|
|     null|     null|      null|45654|
+---------+---------+----------+-----+

In [10]:
##fill the missing value
df_pyspark.na.fill('Missing Value').show()

+-------------+---------+----------+-----+
|         Name|   Salary|Experience|  Age|
+-------------+---------+----------+-----+
|         kunj|    54154|        45|  454|
|         emma|    53454|       546| null|
|        raman|    44546|       465|   45|
|        madhu|     null|       546| 4556|
|       sanjay|546545646|      null| 5456|
|    akarshika|    54645|        54|54785|
|Missing Value|     null|      null|45654|
+-------------+---------+----------+-----+

In [14]:
df_pyspark.na.fill('Missing Value',['Age','Name']).show()

+-------------+---------+----------+-----+
|         Name|   Salary|Experience|  Age|
+-------------+---------+----------+-----+
|         kunj|    54154|        45|  454|
|         emma|    53454|       546| null|
|        raman|    44546|       465|   45|
|        madhu|     null|       546| 4556|
|       sanjay|546545646|      null| 5456|
|    akarshika|    54645|        54|54785|
|Missing Value|     null|      null|45654|
+-------------+---------+----------+-----+